
#+TITLE: Bluebeam MCP Project
#+AUTHOR: Rory Hamaoka
#+EMAIL: rhamoaka@lbl.go
#+DESCRIPTION: Notes for my project
#+OPTIONS: toc:nil num:nil

** DONE Create a New Project Directory and Initialize it with Node Package Manager
#+BEGIN_SRC bash :results output drawer
mkdir mcp-bbstudio
cd mcp-bbstudio
npm init -y
#+END_SRC

#+RESULTS:
| Wrote          | to              | /home/rory/projects/mcp-bbstudio/mcp-bbstudio/package.json: |    |      |             |    |      |    |
|                |                 |                                                             |    |      |             |    |      |    |
| {              |                 |                                                             |    |      |             |    |      |    |
| "name":        | "mcp-bbstudio", |                                                             |    |      |             |    |      |    |
| "version":     | "1.0.0",        |                                                             |    |      |             |    |      |    |
| "main":        | "index.js",     |                                                             |    |      |             |    |      |    |
| "scripts":     | {               |                                                             |    |      |             |    |      |    |
| "test":        | "echo           | \"Error:                                                    | no | test | specified\" | && | exit | 1" |
| },             |                 |                                                             |    |      |             |    |      |    |
| "keywords":    | [],             |                                                             |    |      |             |    |      |    |
| "author":      | "",             |                                                             |    |      |             |    |      |    |
| "license":     | "ISC",          |                                                             |    |      |             |    |      |    |
| "description": |                 |                                                             |    |      |             |    |      |    |
| }              |                 |                                                             |    |      |             |    |      |    |
|                |                 |                                                             |    |      |             |    |      |    |
|                |                 |                                                             |    |      |             |    |      |    |
|                |                 |                                                             |    |      |             |    |      |    |

** DONE Install Required Node.js Dependencies
Install Express for the web server, Axios for Hypertext Transfer Protocol requests, dotenv for managing secrets, and the Model Context Protocol Software Development Kit.
#+BEGIN_SRC bash :results output drawer
npm install express axios dotenv @modelcontextprotocol/sdk
#+END_SRC

#+RESULTS:
:results:

added 106 packages in 4s

33 packages are looking for funding
  run `npm fund` for details
:end:

** DONE Implement the Token Refresh Logic
Create tokens.json to hold authorizations from postman
#+BEGIN_SRC json
{
"access_token": "PASTE_ACCESS_TOKEN",
"refresh_token": "PASTE_REFRESH_TOKEN",
"token_type": "Bearer",
"expires_in": 3600,
"expires_at": 0
}

#+END_SRC


Create `auth-manager.js` to handle loading and refreshing tokens automatically based on the stored expiration timestamp:
#+BEGIN_SRC js
const fs = require('fs');
const axios = require('axios');
require('dotenv').config();

async function getValidToken() {
  let tokens = JSON.parse(fs.readFileSync('tokens.json', 'utf8'));

  if (Date.now() < tokens.expires_at) {
    return tokens.access_token;
  }

  // Token expired, refresh it
  const credentials = Buffer.from(
    `${process.env.BLUEBEAM_CLIENT_ID}:${process.env.BLUEBEAM_CLIENT_SECRET}`
  ).toString('base64');

  const body = new URLSearchParams({
    grant_type: 'refresh_token',
    refresh_token: tokens.refresh_token
  });

  const response = await axios.post(
    'https://authserver.bluebeam.com/auth/oauth/token',
    body.toString(),
    {
      headers: {
        'Authorization': `Basic ${credentials}`,
        'Content-Type': 'application/x-www-form-urlencoded'
      }
    }
  );

  const newTokens = response.data;
  newTokens.expires_at = Date.now() + (newTokens.expires_in - 60) * 1000;
  // Preserve refresh token if a new one was not issued
  if (!newTokens.refresh_token) newTokens.refresh_token = tokens.refresh_token;

  fs.writeFileSync('tokens.json', JSON.stringify(newTokens, null, 2));
  return newTokens.access_token;
}
module.exports = { getValidToken };
#+END_SRC

Test with:
#+begin_src sh :results output
node test-auth.js
#+end_src

#+begin_src sh :results output
node test-auth-endpoint.js
#+end_src

#+RESULTS:
: ◇ injected env (3) from .env // tip: ◈ encrypted .env [www.dotenvx.com]
: {
:   '$id': '1',
:   UserId: 3898632,
:   Email: 'bb-dev@lbl.gov',
:   DisplayName: 'LBNL Fac Dev Team',
:   UserRole: []
: }

